Courses/4420/Lectures/Hardening/Fortification/fortify-online-6420.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Fortify a Linux System</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Fortify a Linux System"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-11-18T07:34-0500"/>
<meta name="author" content="Prabhaker Mateti"/>
<meta name="description" content="Online CEG6420 Course"/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../Top"> HOME </a>
</div>

<div id="preamble">
2013-11-18T07:34-0500<br><a href="http://cecs.wright.edu/~pmateti/Courses/4420/">OnLine CEG 6420: Computer Security</a>
</div>

<div id="content">
<h1 class="title">Fortify a Linux System</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Educational Objectives</a></li>
<li><a href="#sec-2">2 What is Fortification?</a></li>
<li><a href="#sec-3">3 Malware Removal</a></li>
<li><a href="#sec-4">4 Rootkit Removal</a></li>
<li><a href="#sec-5">5 Logging without DoS</a></li>
<li><a href="#sec-6">6 Information Leakage</a></li>
<li><a href="#sec-7">7 Authentication Enhancements</a></li>
<li><a href="#sec-8">8 Race Conditions</a></li>
<li><a href="#sec-9">9 System Audit</a></li>
<li><a href="#sec-10">10 Lab Experiment on Fortify</a></li>
<li><a href="#sec-11">11 Reading List</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Educational Objectives</h2>
<div class="outline-text-2" id="text-1">


<p>
Students should be able to
</p>
<ol>
<li>Determine minimal sofware that meets the expected system functionality
</li>
<li>Uninstall unneeded components
</li>
<li>Install security improving components
</li>
</ol>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> What is Fortification?</h2>
<div class="outline-text-2" id="text-2">


<ol>
<li>Install and configure additional software that improves security
</li>
<li>Removing unnecessary services/software
</li>
<li>Security updates/ patching the OS and system utilities
</li>
<li>Example Fortifications
<ol>
<li>Encrypted File Systems
</li>
<li>Virus detection and removal
</li>
<li>Rootkit Detection and Removal
</li>
<li>Continuous System Audit
</li>
<li>Containers (Lightweight virtualization)
</li>
<li>SELinux security enhancements from NSA
</li>
</ol>

</li>
</ol>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Malware Removal</h2>
<div class="outline-text-2" id="text-3">

<ol>
<li>Malware = viruses + worms + Trojans
</li>
<li>Linux/Unix can be infected with malware.
</li>
<li>E.g.,  "The Hand of Thief" 2013 banking Trojan protype
</li>
<li>A Linux server can scan and remove viruses from Windows files
</li>
</ol>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Rootkit Removal</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> What are Rootkits, Trojans and Backdoors</h3>
<div class="outline-text-3" id="text-4-1">

</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> How do rootkit programs work?</h3>
<div class="outline-text-3" id="text-4-2">

</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Contents of Linux Root Kit 5</h3>
<div class="outline-text-3" id="text-4-3">

</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Detecting Rootkis</h3>
<div class="outline-text-3" id="text-4-4">

</div>

</div>

<div id="outline-container-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> Removal of Rootkits</h3>
<div class="outline-text-3" id="text-4-5">


</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Logging without DoS</h2>
<div class="outline-text-2" id="text-5">


<p>
There is no proper logging in standard Linux kernel. In any system
worthy of being protected, logging is necessary when system calls that
require super user privileges are invoked, when a CPU general
protection error occurs, when kernel denies a resource allocation to a
process, and during module loading. Logging will help detect issues at
least after the fact. On the other hand, there have been exploits that
generated enormous amounts of logging causing a DoS.
</p>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Information Leakage</h2>
<div class="outline-text-2" id="text-6">


<p>
The kernel data files in /proc directory give information about the
running kernel. The address of various exported kernel symbols can be
obtained from /proc/ksyms. An attacker having access to /dev/kmem can
corrupt the kernel data structures with the help of symbol addresses
in this file.
</p>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Authentication Enhancements</h2>
<div class="outline-text-2" id="text-7">


<ol>
<li>We can enhance user account security through machine-generated
   passwords, biometric identification or access tokens.

</li>
<li>It is also important to not to trust other hosts until after host
   keys are verified. 

</li>
<li>Linux Loadable Kernel Modules (LKM) do not have a proper
   authentication system before inserting the modules.
</li>
</ol>



</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Race Conditions</h2>
<div class="outline-text-2" id="text-8">


<ol>
<li>Control of a resource common to &gt;= 2 processes
</li>
<li>Prevention
</li>
<li>Detection
</li>
</ol>


</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> System Audit</h2>
<div class="outline-text-2" id="text-9">

<ol>
<li>Tripwire
</li>
<li>Lynis
</li>
<li>LSAT (Linux Security Auditing Tool)
</li>
<li>dmidecode (BIOS info)
</li>
<li>lshw
</li>
<li>Bastille
</li>
<li>Logwatch
</li>
<li>Psad
</li>
</ol>


</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Lab Experiment on Fortify</h2>
<div class="outline-text-2" id="text-10">

<ol>
<li>Takes 1 to 2 hours by the student
</li>
<li>Practices things discussed above, but not all
<ol>
<li>Includes list: tripwire, ?webmin
</li>
<li>Excluded list: password cracking (a separate lab)

</li>
</ol>

</li>
<li>Download a Linux ISO we provide (time taken not counted)
</li>
<li>Student installs on a USBD or in a virtual box (10 - 15 min)
</li>
<li>Examines this system (30 min)
</li>
<li>Fortifies this system (60 min)
</li>
<li>Writes a lab report (30 min)
</li>
</ol>



</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Reading List</h2>
<div class="outline-text-2" id="text-11">


<ol>
<li>Readings are grouped into Required and Recommended.
</li>
<li>Required Readings are a must read.  These are sources of exam
   questions.
</li>
<li>Recommended Readings bring more insight into the topic.  But exam
   questions will not be derived from these.
</li>
<li>Some of our "readings" are actually web site visits.
</li>
</ol>



</div>

<div id="outline-container-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> Required Reading  (3 hrs)</h3>
<div class="outline-text-3" id="text-11-1">


<ol>
<li>Prabhaker Mateti, RootKits.  2013.

</li>
<li>Prabhaker Mateti, Race Conditions.  2013.

</li>
<li><a href="http://en.wikipedia.org/">http://en.wikipedia.org/</a> wiki/ Category:Linux Security Software, 2013.
</li>
</ol>


</div>

</div>

<div id="outline-container-11-2" class="outline-3">
<h3 id="sec-11-2"><span class="section-number-3">11.2</span> Recommended Reading</h3>
<div class="outline-text-3" id="text-11-2">


<ol>
<li><a href="http://chkrootkit.org/">http://chkrootkit.org/</a>
  chkrootkit is a tool to locally check for signs of a rootkit. 2009.
  Typically installed in Debian.  Highly recommended
  visit/reading.

</li>
<li><a href="http://rkhunter.sourceforge.net/">http://rkhunter.sourceforge.net/</a> The Rootkit Hunter
    project, 2012. Highly recommended visit/reading.

</li>
<li>Dave Dittrich, "Root Kits and hiding files/directories/processes
   after a break-in", Date: 2002/01/05,
   <a href="http://staff.washington.edu/">http://staff.washington.edu/</a> dittrich/ misc/ faqs/rootkits.faq

</li>
<li><a href="http://packetstormsecurity.com/">http://packetstormsecurity.com/</a> Collection of rootkits.
</li>
</ol>




</div>
</div>
</div>
</div>

<div id="postamble">
<hr size=1>Copyright &copy; 2013 &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a> &bull; 2013-11-18T07:34-0500
</div>
</body>
</html>
